#+TODO: TODO(t@) BLOCK(b@) | DONE(d!)
#+STARTUP: indent logdone logdrawer content lognoteclock-out
# ------------------------------------------------------
#+TITLE: Project Planning: zevem
#+AUTHOR: Jordan Ellis Coppard
#+LANGUAGE: en
#+OPTIONS: ^:{}

*** Opcodes
:LOGBOOK:
CLOCK: [2025-12-18 Thu 21:58]--[2025-12-18 Thu 22:19] =>  0:21
- Add GASPRICE without tests
CLOCK: [2025-12-18 Thu 21:55]--[2025-12-18 Thu 21:56] =>  0:01
- CALLDATASIZE already done (without tests)
CLOCK: [2025-12-18 Thu 21:46]--[2025-12-18 Thu 21:53] =>  0:07
- Add CALLVALUE without tests
CLOCK: [2025-12-18 Thu 21:33]--[2025-12-18 Thu 21:41] =>  0:08
- Add CALLER without tests
CLOCK: [2025-12-18 Thu 21:20]--[2025-12-18 Thu 21:29] =>  0:09
- Figure out where I was (somewhat) last. CODESIZE needs a test scenario but looks good for now.
CLOCK: [2025-11-27 Thu 18:38]--[2025-11-27 Thu 20:38] =>  2:00
- SWAP1...SWAP16 implementation; move stackOffTop; script to generate test; overthinking
CLOCK: [2025-11-20 Thu 16:47]--[2025-11-20 Thu 17:03] =>  0:16
- SWAP1...SWAP16 stub
CLOCK: [2025-11-20 Thu 16:41]--[2025-11-20 Thu 16:46] =>  0:05
- Add checklist of remaining opcodes to do
CLOCK: [2025-11-13 Thu 21:32]--[2025-11-13 Thu 21:52] =>  0:20
- ORIGIN with basic tests
CLOCK: [2025-11-13 Thu 02:01]--[2025-11-13 Thu 02:07] =>  0:06
- Stub out 40s opcodes
CLOCK: [2025-11-13 Thu 01:48]--[2025-11-13 Thu 01:56] =>  0:08
- Add MSIZE with basic tests
CLOCK: [2025-11-12 Wed 23:54]--[2025-11-13 Thu 01:40] =>  1:46
- Refactor memory resizing to nextOp, adapt MSTORE tests, add KECCAK test for memory resizing
CLOCK: [2025-11-02 Sun 16:16]--[2025-11-02 Sun 19:53] =>  3:37
- KECCAK256 and surrounding utilities with many sanity checks along the way
CLOCK: [2025-11-02 Sun 03:05]--[2025-11-02 Sun 03:41] =>  0:36
- Add MSTORE8 with basic tests
CLOCK: [2025-11-02 Sun 02:27]--[2025-11-02 Sun 02:59] =>  0:32
- Add basic MLOAD with basic tests
CLOCK: [2025-11-02 Sun 00:52]--[2025-11-02 Sun 01:47] =>  0:55
- Part of MLOAD, need to get laundry right now though.
CLOCK: [2025-10-21 Tue 20:25]--[2025-10-21 Tue 20:50] =>  0:25
- Add GAS with tests, also correct argument ordering for recent JUMP, JUMPI, PC in expectEqual tests.
CLOCK: [2025-10-21 Tue 20:04]--[2025-10-21 Tue 20:12] =>  0:08
- Add annotations for recently implemented JUMP, JUMPI, and PC.
:END:

**** JUMP
:LOGBOOK:
CLOCK: [2025-10-21 Tue 17:18]--[2025-10-21 Tue 19:04] =>  1:46
- JUMP/JUMPDEST implemented with basic tests. DynamicBitSetUnmanaged to pre-scan and construct bitset of valid JUMPDEST locations.
CLOCK: [2025-09-24 Wed 22:14]--[2025-09-24 Wed 22:58] =>  0:44
- More reading on JUMP and friends, yep we gotta do all the validation ourselves. Oh boy.
CLOCK: [2025-09-24 Wed 18:46]--[2025-09-24 Wed 19:08] =>  0:22
- Read associated YP information, need to implement JUMPDEST too and some more logic according to 9.4.3 so will do this later.
:END:

(9.4.3) Function D determines set of valid jump destinations. To be valid:

1. Position must be occupied by a JUMPDEST instruction.
2. JUMPDEST must not reside within data portion of any PUSH.
3. Must appear within explicitly defined bytecode, and not the implicit infinite STOP padding.

Zig bit sets look good for this: https://ziglang.org/documentation/0.14.1/std/#std.bit_set

Not possible to know bytecode length at comptime, could set an upperbound but would require re-compiling if block gas limits change to allow more bytecode to be executed so DynamicBitSetUnmanaged from stdlib looks like a good pre-provided data structure for this.

**** JUMPI
:LOGBOOK:
CLOCK: [2025-10-21 Tue 19:32]--[2025-10-21 Tue 20:02] =>  0:30
- Add JUMPI with basic tests
:END:

**** PC
:LOGBOOK:
CLOCK: [2025-10-21 Tue 19:11]--[2025-10-21 Tue 19:27] =>  0:16
- Add PC with basic tests
:END:

**** TODO CALLDATASIZE
:LOGBOOK:
- State "TODO"       from              [2025-11-27 Thu 21:07] \\
  CALLDATASIZE pushes I_d, currently using that (incorrectly). The opcode now exists in zevem but Transaction.zig needs to be adjusted
CLOCK: [2025-11-27 Thu 20:46]--[2025-11-27 Thu 21:06] =>  0:20
- CALLDATASIZE but Transaction needs to be adjusted
:END:

**** Memory usage
:LOGBOOK:
CLOCK: [2025-08-25 Mon 14:51]--[2025-08-25 Mon 15:00] =>  0:09
CLOCK: [2025-08-24 Mon 18:30]--[2025-08-25 Mon 00:47] =>  6:17
:END:

C_mem(μ_i′) - C_mem(μ_i)

***** Comptime memory size
:LOGBOOK:
CLOCK: [2025-09-09 Tue 19:03]--[2025-09-09 Tue 21:07] =>  2:04
- Got actual dynamic gas (based on simpler memory size changes) actually working (correctness in terms of the price it reports to be tested still).
CLOCK: [2025-09-09 Tue 17:06]--[2025-09-09 Tue 18:32] =>  1:26
- Basic comptime function generation for memory size functions MVP.
:END:

Define memory size function for an opcode in the comptime MakeOpCodes tuple.

***** MSTORE
:LOGBOOK:
CLOCK: [2025-09-09 Tue 14:37]--[2025-09-09 Tue 17:01] =>  2:24
- Re-aqainting myself with gas charging again; implement hardcoded dynamic gas cost for MSTORE. This will need to be made generic essentially immediately.
:END:

*** Misc
:LOGBOOK:
CLOCK: [2025-11-28 Fri 16:28]--[2025-11-28 Fri 18:16] =>  1:48
- Re-reviewing transaction structure (YP, other notes), also found a Zig compiler bug with SWAP only in ReleaseSafe which I need to ignore for now
CLOCK: [2025-11-13 Thu 19:30]--[2025-11-13 Thu 21:16] =>  1:46
- Horrible time double checking I_o for 0x32 ORIGIN and the fact that it's just T_s
CLOCK: [2025-11-13 Thu 17:51]--[2025-11-13 Thu 19:21] =>  1:30
- Migrate from BlockHeader struct with fields to methods on DummyEnv comptime interface
:END:

**** Disassembly Logging
:LOGBOOK:
CLOCK: [2025-09-04 Thu 22:51]--[2025-09-05 Fri 00:47] =>  1:56
CLOCK: [2025-09-04 Thu 21:47]--[2025-09-04 Thu 22:31] =>  0:44
CLOCK: [2025-09-04 Thu 19:26]--[2025-09-04 Thu 21:40] =>  2:14
CLOCK: [2025-09-02 Tue 21:18]--[2025-09-02 Tue 21:21] =>  0:03
CLOCK: [2025-09-02 Tue 18:47]--[2025-09-02 Tue 20:53] =>  2:06
CLOCK: [2025-09-01 Mon 21:34]--[2025-09-01 Mon 21:41] =>  0:07
CLOCK: [2025-09-01 Mon 19:22]--[2025-09-01 Mon 20:37] =>  1:15
CLOCK: [2025-09-01 Mon 16:47]--[2025-09-01 Mon 17:55] =>  1:08
CLOCK: [2025-09-01 Mon 14:42]--[2025-09-01 Mon 15:06] =>  0:24
CLOCK: [2025-08-30 Sat 17:51]--[2025-08-30 Sat 20:54] =>  3:03
:END:

Good-enough disassembly-type logging until "real" and "better" (perhaps structured) logging implemented once zevem is 1.0. These are the functions ~traceOpNew~ and friends.

